Autodesk.Revit.DB.FabricationRodInfo.GetRodEndPosition(System.Int32)
Gets the position of the rod end.
rodIndex:
The index of the rod.
Returns:
The position of the rod end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the count of structues must be 0 or equals to rod count.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.GetRodAttachedElementId(System.Int32)
Gets the id of the attached component for the specified rod.
rodIndex:
The index of the specified rod.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the count of structues must be 0 or equals to rod count.
-or-
The rods do not attached to any structue.
Since:
2016